src/main/resources/templates/smartpay/SmartpayRefundOrderTemplate.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        >
    <soap:Body>
        <ns1:refund xmlns:ns1="http://payment.services.adyen.com">
            <ns1:modificationRequest>
                <merchantAccount xmlns="http://payment.services.adyen.com">${merchantCode}</merchantAccount>
                <modificationAmount xmlns="http://payment.services.adyen.com">
                    <currency xmlns="http://common.services.adyen.com">GBP</currency>
                    <value xmlns="http://common.services.adyen.com">${amount}</value>
                </modificationAmount>
                <originalReference xmlns="http://payment.services.adyen.com">${transactionId?xml}</originalReference>
                <reference xmlns="http://payment.services.adyen.com">${reference?xml}</reference>
            </ns1:modificationRequest>
        </ns1:refund>
    </soap:Body>
</soap:Envelope>
